//Задание 1
var arr1 = ['a', 'b', 'c'];
alert ('Элементы массива \n' + arr1[0] + '\n' + arr1[1] + '\n' + arr1[2]);

//задание 2
var arr = ['a', 'b', 'c', 'd'];
alert (arr[0] + '+' + arr[1]+ ',' +  arr[2] + '+' + arr[3]);

//задание 3
var arr2 = [2, 5, 3, 9];
var result = arr2[0] * arr2[1] + arr2[2] * arr2[3];
alert ('Значение переменной ' + result);

//Задание 4
var obj = {a: 1, b: 2, c: 3};
alert ('Элемент по свойству объекта ' + obj.c + '\nЭлемент через квадратные скобки ' + obj['c']);

// Задание 5
var obj1 = {Коля: '1000', Вася: '500', Петя: '200'};
alert ('Зарплата Пети ' + obj1.Петя + '\nЗарплата Коли ' + obj1.Коля);

// Задание 6
var week = {1: 'Понедельник', 2: 'Вторник', 3: 'Среда', 4: 'Четверг', 5: 'Пятница', 6: 'Суббота', 7: 'Воскресенье'};
var day = 2;
alert ('Текущий день недели ' + week[day]);


//Задание 7
var number = { 
    1 : [1, 2, 3], 
    2 : [4, 5, 6], 
    3 : [7, 8 ,9]
 } ;
alert ('Цифра из многомерного массива ' + number[2][0]);

//Задание 8
var prog = {
    js: ['jQuery', 'Angular'],
    php: 'hello', 
    css: 'world'
    };
alert ('Элемент из многомерного массива ' + prog['js']['0']);

//Задание 9
var wk = {
    ru: ['Понедельник', 'Вторник', 'Среда', 'Четверг' ,'Пятница' ,'Суббота' ,'Воскресенье'],
    en: ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']     
};
alert ('День недели на русском языке: ' + wk['ru'][0] + '\nДень недели на английском языке: '+ wk['en'][2]);

//Задание 10
var lang = 'ru';
var day = 3;
alert (day + 'й день недели по ключу ' + lang + ' - ' + wk[lang][day]);
