//задание 1
var str = 'Переменная со значением';
var num = 3;
alert (str + '\n' + num);

//задание 2
var a = 10;
var b = 2;
alert ('Сумма ' + a + ' и ' + b + ' = ' + (a + b) + '\n' +
'Разность ' + a + ' и ' + b + ' = ' + (a - b) + '\n' +
'Произведение ' + a + ' и ' + b + ' = ' + (a * b) + '\n' +
'Частное ' + a + ' и ' + b + ' = ' + (a / b));

//задание 3
var c = 15;
var d = 2;
var result = (c + d)
alert ('Сумма ' + c + ' и ' + d + ' равна\n ' + result);

//задание 4
var a1 = 10;
var b1 = 2;
var c1 = 5;
alert ('Сумма ' + a1 + ', ' + b1 + ' и '+ c1 + ' равна\n ' + (a1 + b1 + c1));

//задание 5
var a2 = 17;
var b2 = 10;
var c2 = (a2-b2);
var d2 = 7;
var result1 = (c2 + d2);
alert ('Сумма ' + c2 + ' и ' + d2 + ' равна\n ' + result1);

//задание 6
var str = 'Привет, Мир!'
alert (str);

//задание 7
var str1 = 'Привет, ';
var str2 = 'Мир!';
alert (str1 + str2);

//задание 8
var name1 = 'Максим';
alert ('Привет, ' + name1);

//задание 9
var age = 18;
alert ('Мне ' + age +' лет!');

//задание 10 
var name2 = prompt('Ваше имя');
alert ('Ваше имя ' + name2);

//задание 11
var numb = prompt('Введите любое число');
alert ('квадрат введеного числа = '+ numb * numb);

//задание 12
var str = 'abcde';
alert('Символы строки ' + str + ' \n' + str[0] + ' \n' + str[2] + ' \n' + str[4]);

//задание 13
var num3 = '12345';
alert ('Произведение цифр числа ' + num3 + '\n' + (num3[0] * num3[1] * num3[2] * num3[3] * num3[4]));

//задание 14
alert ('Секунд в часе: ' + (60*60) + '\n'
   + 'Секунд в сутках: ' + (60*60*24) + '\n'
   + 'Секунд в месяце: ' + (60*60*24*30));

//задание 15
var h = '22:';
var m = '48:';
var s = '51';
alert ('Время написания скрипта: ' + h + m + s);

//Зажание 16
var p = 3;
alert ('Квадрат числа ' + p + ' = ' + (p*p));

//Зажание 17
var num5 = 47;
alert ('Сумма ' + num5 + ' и ' + 7 + ' = ' + (num5 += 7) + '\n' +
'Разность ' + num5 + ' и ' + 18 + ' = ' + (num5 -= 18) + '\n' +
'Произведение ' + num5 + ' и ' + 10 + ' = ' + (num5 *= 10) + '\n' +
'Частное ' + num5 + ' и ' + 15 + ' = ' + (num5 /= 15));

//задание 18
var num4 = 10;
num4 ++;
num4 ++;
num4 --;
alert('Результат после двух инкрементов и одного декремента ' + num4);